# install packages
#
# specify a directory to install
cask_args appdir: '/Applications'

tap 'caskroom/homebrew-cask' || true
tap "homebrew/bundle"
tap "homebrew/core"

# System Deps
brew "autoconf"
brew "automake"
brew 'bash-completion'
brew "coreutils"
brew "curl"
brew "ctags"
brew "gettext"
brew 'git'
brew "gpg2"
brew "imagemagick"
brew "libpng"
brew "libtool"
brew "libevent"
brew "libffi"
brew "libyaml"
brew "libxml2"
brew "libxslt"
brew "openssl"
brew "readline"
brew "unixodbc"
brew "wget"

# Tools
brew "htop-osx"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tmux"
brew "reattach-to-user-namespace"
brew "z"

# Languages
brew "rbenv"
brew "node"
brew "elixir"
cask "dotnet"
cask 'java'


# Runtime Switchers
brew "asdf"

# Services
brew "heroku"
brew "hub"
brew "s3cmd"
brew "awsebcli"

# Databases
#cask "postgres" # prefer Postgres.app
brew "mysql", restart_service: true
brew "redis"
brew "mongodb"
brew "memcached"
brew "elasticsearch"

# Editor
tap 'neovim/neovim' || true
brew 'neovim'
cask 'atom'

# VIM 
brew "ripgrep"

# Applications
#cask 'iterm2'
#cask 'google-chrome'
#cask '1password'
#cask 'dropbox'
#cask 'virtualbox'
#cask 'docker'
#cask 'slack'
#cask 'spotify'
#cask 'postman'

# Client GUIs
#cask "fork" # Git
#cask "postico" # Postgres
#cask "sequel-pro" # MySql
#cask "commander-one" # S3/FTP
#cask "robo-3t" # MongoDB

#cask "amethyst"
